posts/2016-06-12-prayer-for-orlando.org
#+date: <2016-06-12>
#+filetags: prayer religion
#+title: Prayer for Orlando

Lord Jesus,

On this day that we mourn\\
the loss of so many whom you love,\\
it is tempting to pray\\
that you would return\\
and take us from this world.

Tempting, because it shifts\\
the burden to you,\\
leaving nothing for us\\
but escape, evasion, and excuse.

Yet you are not the God who excuses,\\
but the God who redeems;\\
not the God of escape,\\
but the God of the cross.

You are not a passive God,\\
and neither should we\\
be a passive people.

So we pray,\\
not because it is\\
the only thing we can do,\\
but because it is\\
the first thing.

For what should follow,\\
give us the wisdom to know it;\\
grant us the courage to do it.

/Amen/


#+begin_tagline
Tagged: [[file:../tags/prayer.org][Prayer]] [[file:../tags/religion.org][Religion]]
#+end_tagline
