docs/posts/2016-06-12-prayer-for-orlando.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer for Orlando</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer for Orlando</h1>
<p class="subtitle" role="doc-subtitle">Jun 12, 2016</p>
</header><p>
Lord Jesus,
</p>

<p>
On this day that we mourn<br>
the loss of so many whom you love,<br>
it is tempting to pray<br>
that you would return<br>
and take us from this world.
</p>

<p>
Tempting, because it shifts<br>
the burden to you,<br>
leaving nothing for us<br>
but escape, evasion, and excuse.
</p>

<p>
Yet you are not the God who excuses,<br>
but the God who redeems;<br>
not the God of escape,<br>
but the God of the cross.
</p>

<p>
You are not a passive God,<br>
and neither should we<br>
be a passive people.
</p>

<p>
So we pray,<br>
not because it is<br>
the only thing we can do,<br>
but because it is<br>
the first thing.
</p>

<p>
For what should follow,<br>
give us the wisdom to know it;<br>
grant us the courage to do it.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="orge419bb4">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
